N = 1041


def solution(N):
  value = format(N, 'b')#２進数に変換（str型）
  maxGap = 0#最大ギャップ
  accumulated = 0#累積カウント

#先頭から（先頭は必ず１である）
  for i in value:
    #0ならば累積カウント+1
    if i == '0':
      accumulated += 1
    #1ならば累積カウントが最大ギャップより大きければ最大ギャップを更新
    elif i == '1':
      if accumulated > maxGap:
        maxGap = accumulated
      accumulated = 0
  return maxGap
    

ans = solution(N)
print(ans)

'''
case N = 1041

binary number = 10000010001
------------------------------------------------------------
     i       | 1 | 0 | 0 | 0 | 0 | 0 | 1 | 0 | 0 | 0 | 1
------------------------------------------------------------
 accumulated | 0 | 1 | 2 | 3 | 4 | 5 | 0 | 1 | 2 | 3 | 0
------------------------------------------------------------
   maxGap    | 0 | 1 | 2 | 3 | 4 | 5 | 5 | 5 | 5 | 5 | 5 
------------------------------------------------------------

O(N)

'''

